questions = {
    1: {
        "text": "Выберите ваше идеальное место для жизни:",
        "image": "/content/images/q1.png",
        "options": [
            ("Высокие горные вершины 🏔", "tur"),
            ("Яркие и влажные тропические джунгли 🌿", "frog"),
            ("Спокойное дно чистого озера 🐢", "turtle"),
            ("Ветви высокого дерева с видом на весь лес 🐦", "magpie"),
            ("Тенистое и уютное убежище в камнях 🐍", "viper")
        ]
    },
    2: {
        "text": "Какая черта характера вам ближе всего?",
        "image": "/content/images/q2.png",
        "options": [
            ("Легкость на подъем и общительность 📢", "magpie"),
            ("Несокрушимая сила и воля 💪", "tur"),
            ("Хладнокровие и стратегия 🧠", "viper"),
            ("Яркая индивидуальность и смелость ✨", "frog"),
            ("Терпение и умение ждать ⏳", "turtle")
        ]
    },
    3: {
        "text": "Как вы относитесь к стрессовым ситуациям?",
        "image": "/content/images/q3.png",
        "options": [
            ("Ухожу в себя и жду затишья 🛡", "turtle"),
            ("Тихо анализирую слабые места 🔍", "viper"),
            ("Иду напролом до победного 💥", "tur"),
            ("Обсуждаю ситуацию с друзьями 🗣", "magpie"),
            ("Привлекаю внимание и ищу поддержку 🌈", "frog")
        ]
    },
    4: {
        "text": "Ваш идеальный стиль работы — это...",
        "image": "/content/images/q4.png",
        "options": [
            ("Творческий хаос и вспышки идей 💡", "frog"),
            ("Одиночная работа с погружением 🧘", "viper"),
            ("Командный движ и обмен идеями 🤝", "magpie"),
            ("Тяжелый труд до результата 🏗", "tur"),
            ("Медленное и верное движение 🐢", "turtle")
        ]
    },
    5: {
        "text": "Что для вас является главной ценностью?",
        "image": "/content/images/q5.png",
        "options": [
            ("Свобода и новые впечатления 🌍", "magpie"),
            ("Безопасность и стабильность 🏠", "turtle"),
            ("Власть и личный авторитет 👑", "tur"),
            ("Мудрость и тайные знания 📜", "viper"),
            ("Красота и внимание окружающих 🔥", "frog")
        ]
    }
}
